package com.example.project1.ui.instructions;

import com.example.project1.ui.instructions.*;
import android.text.Html;
import android.os.Bundle;
import android.util.Log;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;
import androidx.viewpager2.widget.ViewPager2;

import com.example.project1.R;

import java.util.ArrayList;
import java.util.List;

/**
 *Displays a sequence of instructional slides related to first aid topics, dynamically populated based on the selected topic title passed as an argument.
 *It helps users visually follow steps with formatted text and images.
 * @author kostissotiriou
 */
public class InstructionsFragment extends Fragment {

    public InstructionsFragment() {

    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        View root = inflater.inflate(R.layout.fragment_instructions, container, false);

        Bundle args = getArguments();
        if (args != null) {
            String title = args.getString("title");

            Log.d("InstructionsFragment", "title: " + title);

            TextView titleTextView = root.findViewById(R.id.instructions_title);
            titleTextView.setText(title);


            ViewPager2 viewPager = root.findViewById(R.id.instructions_pager);
            List<InstructionStep> steps = new ArrayList<>();

            //slides
            //Βασικές Γνώσεις
            if ("Βασικές Γνώσεις".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Βασικές Οδηγίες και Γνώσεις.</b> <br><br>" +
                        " Προσέγγιση Θύματος, θέση ασφαλείας και αξιολόγηση της κατάστασης"), R.drawable.general_basic
                ));
                steps.add(new InstructionStep(Html.fromHtml("<b>Ασφαλής Προσέγγιση Ασθενούς</b><br><br>1. Φροντίστε να είστε ασφαλείς και να προστατεύετε τον τραυματισμένο από περαιτέρω κινδύνους.<br>" +
                        "2. Αν ο τραυματισμός είναι σοβαρός, καλέστε το ΕΚΑΒ (166) ή το 112.<br>" +
                        "3. Αποφύγετε την επαφή με τα σωματικά υγρά του θύματος. Χρησιμοποιείστε γάντια.<br>"), R.drawable.second_slide_basic));
                steps.add(new InstructionStep(Html.fromHtml("<b>Εκτίμηση Πάσχοντα</b><br><br>Η εκτίμηση του πάσχοντα γίνεται σύμφωνα με μια σειρά ενεργειών, οι οποίες είναι ίδιες σε όλο τον κόσμο:" +
                        "<br>1. Έλεγχος του αεραγωγού." +
                        "<br>2. Έλεγχος για την ύπαρξη αναπνοής." +
                        "<br>3. Έλεγχος της κυκλοφορίας." +
                        "<br>4. Νευρολογικός Έλεγχος" +
                        "<br>5. Έκθεση και προστασία από το περιβάλλον"), R.drawable.second_slide_basic));
                steps.add(new InstructionStep(Html.fromHtml("<b>Κλήση στο ΕΚΑΒ</b><br><br>Τι πρέπει να συμπεριλάβουμε στην κλήση στο ΕΚΑΒ:" +
                        "<br>1. Το τηλέφωνο και το όνομά μας." +
                        "<br>2. Τι περιστατικό έχει συμβεί." +
                        "<br>3. Πού έγινε το περιστατικό." +
                        "<br>4. Πόσα είναι τα θύματα." +
                        "<br>5. Πότε έγινε." +
                        "<br>6. Άλλες σημαντικές πληροφορίες." +
                        "<br><b>Κλέινουμε πάντα τελευταίοι το τηλέφωνο!</b>"), R.drawable.fourth_slide_basic));
                steps.add(new InstructionStep(Html.fromHtml("<b>Θέση Ασφαλείας (1/2)</b><br>Εάν το θύμα έχει χάσει τις αισθήσεις του, αλλά αναπνέει, το τοποθετούμε σε θέση ασφαλείας.<br>" +
                        "<br>1. Τοποθετούμε το άτομο ανάσκελα με τα πόδια του σε ευθεία και τα χέρια κοντά στο σώμα." +
                        "<br>2. Τοποθετούμε το ένα χέρι σε ορθή γωνία προς τα πάνω." +
                        "<br>3. Φέρνουμε το άλλο χέρι πάνω στο στήθος με κατεύθυνση προς τον ώμο, και την παλάμη προς τα κάτω."), R.drawable.recovery_position));
                steps.add(new InstructionStep(Html.fromHtml("<b>Θέση Ασφαλείας (2/2)</b><br>Εάν το θύμα έχει χάσει τις αισθήσεις του, αλλά αναπνέει, το τοποθετούμε σε θέση ασφαλείας.<br>" +
                        "<br>4. Από την ίδια πλευρά. λυγίζουμε το πόδι ώστε να πατήσει στο έδαφος το πέλμα." +
                        "<br>5. Γυρίζουμε το θύμα στο πλάι, ώστε το λυγισμένο πόδι να είναι από πάνω." +
                        "<br>6. Φέρνουμε το κεφάλι σε ελαφρά έκταση, για να μην παρεμποδίζεται ο αεραγωγός." +
                        "<br><b>Καλoύμε το ΕΚΑΒ ή το 112!</b>"), R.drawable.recovery_position));
            //οδηγίες ΚΑΡΠΑ
            } else if ("ΚΑΡΠΑ".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Καρδιοαναπευστική Αναζωογόνηση (ΚΑΡΠΑ)</b><br><br>" +
                        "Εάν το θύμα δεν ανταποκρίνεται, τότε εφαρμόζουμε το πρωτόκολλο βασικής υποστήριξης ζωής."), R.drawable.first_slide_basic));
                steps.add(new InstructionStep(Html.fromHtml("<b>Καρδιοαναπευστική Αναζωογόνηση (ΚΑΡΠΑ)</b><br>" +
                        "<br>1. Ελέγχουμε εάν ο αεραγωγός είναι ανοιχτός." +
                        "<br>2. Ελέγχουμε εάν ο αεραγωγός είναι ανοιχτός." +
                        "<br>3. Κρατώντας από το μέτωπο και το σαγόνι, εκτείνουμε το κεφάλι προς τα πίσω για να απελλεύθερωθεί ο αεραγωγός από την γλώσσα."), R.drawable.second_slide_cpr));
                steps.add(new InstructionStep(Html.fromHtml("<b>ΚΑΡΠΑ</b><br>" +
                        "<br>Για 10 δευτερόλεπτα:" +
                        "<br>1. <b>Βλέπω</b> αν ανεβοκατεβαίνει ο θώρακας." +
                        "<br>2. <b>Ακούω</b> αν βγαίνει αέρας από την μύτη και το στόμα." +
                        "<br>3. <b>Αισθάνομαι</b> στο μάγουλό μου την κίνηση και την υγρασία του αέρα." +
                        "<br>Ψάχνω για κανονικές αναπνοές, χωρίς παράξενους ήχους. Εάν δεν δούμε, ακούσουμε, αισθανθούμε, άμεσα καλούμε το ΕΚΑΒ και ξεκινάμε θωρακικές συμπιέσεις."), R.drawable.second_slide_cpr));
                steps.add(new InstructionStep(Html.fromHtml("<b>Θωρακικές Συμπιέσεις</b><br>" +
                        "<br>Οι Θωρακικές συμπιέσεις γίνονται στην μέση του θώρακα, πάνω στο στέρνο:" +
                        "<br>1. Βάζουμε το ένα χέρι πάνω στο άλλο και πλέκουμε τα δάκτυλά μας." +
                        "<br>2. Βάζουμε την βάση της παλάμης μας στο κάτω μισό του στέρνου." +
                        "<br>3. Τεντώνουμε τους αγκώνες και με ώμους παράλληλους στο θύμα ξεκινάμε συμπιέσεις." +
                        "<br>4. Κάνουμε 30 θωρακικές συμπιέσεις, με το βάρος του σώματός μας, ρυθμό 100-120 ανά λεπτό και βάθος 5-6 cm."), R.drawable.chest_compressions_cpr));
                steps.add(new InstructionStep(Html.fromHtml("<b>Εμφυσήσεις</b><br>" +
                        "<br>1. Απελευθερώνουμε τον αεραγωγό." +
                        "<br>2. Εκτείνουμε το κεφάλι, ανυψώνουμε το πιγούνι και κλείνουμε την μύτη." +
                        "<br>3. Σφραγίζουμε τα χείλη μας γύρω από το στόμα του θύματος και εκπνέουμε μέχρι να ανυψωθεί ο θώρακας." +
                        "<br>4. Απομακρύνουμε το κεφάλι μας για να κάνει εκπνοή και επαναλλαμβάνουμε για δεύτερη φορά." +
                        "<br><b>Εφαρμόζουμε την διαδικασία των 30 συμπιέσεων και 2 εμφυσήσεων μέχρι να έρθει βοήθεια ή το θύμα να ανανήψει.</b>"), R.drawable.rescue_breaths_cpr));
            //οδηγιες απινιδωτη
            }else if("Χρήση Αυτόματου Απινιδωτή".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Αυτόματος Εξωτερικός Απινιδωτής</b><br>" +
                        "<br>Ο Αυτόματος Εξωτερικός Απινιδωτής συναντάται σε πολυσύχναστους χώρους. Υπάρχει ευκρινής και συγκεκριμένη σηματοδότηση του χώρου στο οποίο είναι εγκαταστημένοι."), R.drawable.sign_aed));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αυτόματος Εξωτερικός Απινιδωτής</b><br>" +
                        "<br>1. Είναι ασφαλές μηχάνημα." +
                        "<br>2. Ακολουθούμε τις οδηγίες που μας λέει." +
                        "<br>3. Πρέπει να βρισκόμαστε σε χώρο που δεν έχει νερά και μεταλλικές επιφάνειες." +
                        "<br>4. Ακολουθούμε το πρωτόκολλο όπως και όταν δεν έχουμε απινιδωτή." +
                        "<br>5. Ζητάμε σε κάποιον να φέρει τον απινιδωτή όσο συνεχίζουμε να κάνουμε ΚΑΡΠΑ."), R.drawable.aed_picture));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αυτόματος Εξωτερικός Απινιδωτής</b><br>" +
                        "<br>6. Ακολουθούμε τις οδηγίες που μας δίνει ο απινιδωτής." +
                        "<br>7. Στο γυμνό και στεγνό στέρνο τοποθετούμε τα αυτοκόλλητα ηλεκτρόδια ως εξής:" +
                        "<br>   - Το ένα μια παλάμη κάτω από την αριστερή μασχάλη." +
                        "<br>   - Το δεύτερο λίγο κάτω από την δεξιά κλείδα." +
                        "<br>8. Βάζουμε στην υποδοχή της συσκευής το βύσμα των ηλεκτροδίων και αυτή αναλύει τον καρδιακό παλμό." +
                        "<br>9. Απομακρύνουμε τον κόσμο και δεν ακουμπάμε ούτε εμείς το θύμα."), R.drawable.aed_placement));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αυτόματος Εξωτερικός Απινιδωτής</b><br>" +
                        "<br>10. Αν η συσκευή κρίνει απαραίτητη την απινίδωση, αρχίζει να φορτίζει και ακούγεται ένας χαρακτηριστικός ήχος όταν είναι έτοιμη." +
                        "<br>11. Φωνάζουμε<br> <b>ΑΠΟΜΑΚΡΥΝΘΕΙΤΕ ΘΑ ΔΩΣΩ ΡΕΥΜΑ</b>." +
                        "<br>12. Όταν βεβαιωθούμε ότι κανείς, όυτε εμείς, ακουμπάει το θύμα πατάμε το κουμπί και δίνουμε την ηλεκτρική εκκένωση."
                        ), R.drawable.aed_picture1));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αυτόματος Εξωτερικός Απινιδωτής</b><br>" +
                        "<br>13. Μετά ακολουθούμε τις οδηγίες του απινιδωτή." +
                        "<br>14. Αν το θύμα αρχίσει να αναπνέει κανονικά, το τοποθετούμε σε πλάγια θέση ασφαλείας." +
                        "<br>15. Αν δεν επανέλθει συνεχίζουμε την ΚΑΡΠΑ."), R.drawable.recovery_position));
            //κουτι πρώτων βοηθειών
            } else if ("Κουτί Πρώτων Βοηθειών".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Κουτί πρώτων Βοηθειών</b><br>" +
                        "<br>Ένα καλά εξοπλισμένο κουτί πρώτων βοηθειών μπορεί να βοηθήσει\n" +
                        "αποτελεσματικά στους απλούς τραυματισμούς ή σε καταστάσεις έκτακτης\n" +
                        "ανάγκης. Έχουμε ένα κουτί πρώτων βοηθειών στο σπίτι μας και ένα στο\n" +
                        "αυτοκίνητό μας. Αποθηκεύουμε σε προσβάσιμο μέρος μακριά από μικρά παιδιά."), R.drawable.first_aid_kit_picture));
                steps.add(new InstructionStep(Html.fromHtml("<b>Κουτί πρώτων Βοηθειών</b><br>" +
                        "<br><b>Βασικός Εξοπλισμός:</b>" +
                        "<br>1. Γάντια" +
                        "<br>2. Ψαλίδι" +
                        "<br>3. Ελαστικοί Επίδεσμοι" +
                        "<br>4. Γάζες απλές και αποστειρωμένες" +
                        "<br>5. Αντισηπτικό Υγρό" +
                        "<br>6. Θερμόμετρο" +
                        "<br>7. Σακούλες σε διάφορα μεγέθη"), R.drawable.first_aid_supplies));
                steps.add(new InstructionStep(Html.fromHtml("<b>Κουτί πρώτων Βοηθειών</b><br>" +
                        "<br><b>Φάρμακα:</b>" +
                        "<br>1. Αντιπυρρετικά" +
                        "<br>2. Παυσίπονα" +
                        "<br>3. Αντισταμινικά Χάπια" +
                        "<br>4. Αντιβιωτική Αλοιφή" +
                        "<br>5. Χάπια για την διάρροια" +
                        "<br>6. Gel για εγκαύματα" +
                        "<br>7. EpiPen/Αδρεναλίνη για αλλεργίες αν έχει συνταγογραφηθεί από γιατρό"), R.drawable.first_aid_medicine));
            //πνιγμονή
            }else if ("Πνιγμονή από Ξένο Σώμα".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Πνιγμονή από Ξένο Σώμα</b><br><br>" +
                        "Η απόφραξη μπορεί να είναι μερική ή πλήρης. Αφορά ενήλικες μετά από λήψη τροφής."+
                        "<br> -Στη μερική απόφραξη το θύμα έχει έντονη ανησυχία και βήχα." +
                        "<br> -Στη πλήρη απόφραξη το θύμα δεν μπορεί να μιλήσει, να βήξει ή να αναπνεύσει." +
                        "<br> -Χάνει γρήγορα τις αισθήσεις του." +
                        "<br> -Το θύμα πνιγμονής συνήθως φέρνει τα χέρια του στο λαιμό."), R.drawable.heimlich_picture));
                steps.add(new InstructionStep(Html.fromHtml("<b>Πνιγμονή από Ξένο Σώμα</b><br>" +
                        "<br>1. Εάν το θύμα αναπνέει ενθαρρύνουμε να βήξει δυνατά κοιτάζοντας προς τα κάτω." +
                        "<br>2. Το βοηθάμε να σκύψει μπροστά και το χτυπάμε με τη βάση της παλάμης ανάμεσα στις δύο ωμοπλάτες με πέντε δυνατά χτυπήματα." +
                        "<br>3. Εάν εξακολουθήσει να υπάρχει απόφραξη τότε εφαρμόζουμε 5 κοιλιακές ώσεις αμέσως κάτω από την ξιφοειδή απόφυση. Βάζοντας το ένα χέρι μας σε μπουνιά και πιέζοντας με το άλλο μέσα και πάνω." +
                        "Στις έγκυες γυναίκες γίνεται στο κέντρο του θώρακα."), R.drawable.heimlich_adult));
                steps.add(new InstructionStep(Html.fromHtml("<b>Πνιγμονή από Ξένο Σώμα<br><br>" +
                        "Πώς να βοηθήσουμε τον εαυτό μας:</b>"+
                        "<br>1. Σίγουρα θα αρχίζουμε να βήχουμε για να αποβληθεί το ξένο σώμα." +
                        "<br>2. Εάν εξακολουθήσει η απόφραξη τότε πηγαίνουμε σε μια κόχη όπως ένα τραπέζι ή πλάτη μιας καρέκλας και πιέζουμε εκεί που τελειώνει το στέρνο, στην ξιφοειδή απόφυση."), R.drawable.heimlich_alone));
                steps.add(new InstructionStep(Html.fromHtml("<b>Πνιγμονή από Ξένο Σώμα</b><br><br>" +
                        "Μανούβρα Heimlich σε παιδιά:"+
                        "<br>1. Εάν το παιδί αναπνέει το ενθαρρύνουμε να βήξει δυνατά." +
                        "<br>2. Βοηθάμε το παιδί να σκύψει μπροστά και το κτυπάμε με τη βάση της παλάμης ανάμεσα στις δύο ωμοπλάτες με πέντε δυνατά χτυπήματα." +
                        "<br>1. Εάν εξακολουθεί να υπάρχει απόφραξη τότε εφαρμόζουμε 5 κοιλιακές ωθήσεις στην ξιφοειδή απόφυση. Οι συμπιέσεις στην κοιλιά επιτρέπονται από το 2ο έτος της ηλικίας."
                ), R.drawable.heimlich_child));
                steps.add(new InstructionStep(Html.fromHtml("<b>Πνιγμονή από Ξένο Σώμα</b><br><br>" +
                        "Μανούβρα Heimlich σε βρέφη:"+
                        "<br>1. Εάν το βρέφος δεν αναπνέει και δεν κλαίει, το βάζουμε στον πήχη του ενός χεριού μας και κρατώντας το σαγόνι του ανοιχτό χτυπάμε 5 φορές ανάμεσα στις ωμοπλάτες." +
                        "<br>2. Εάν εξακολουθεί να υπάρχει απόφραξη εφαρμόζουμε 5 θωρακικές συμπιέσεις ανάμεσα από τις θηλές." +
                        "<br><b>Σε κάθε περίπτωση αν το θύμα χάσει τις αισθήσεις του και καταρρεύσει εφαρμόζουμε την ΚΑΡΠΑ!</b>"
                ), R.drawable.heimlich_infant));

            } else if ("Αιμορραγία".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Έλεγχος Αιμορραγίας</b><br>" +
                        "<br>Αιμορραγία ονομάζουμε την απώλεια αίματος λόγω ρήξης του αγγείου που\n" +
                        "προκαλείται από τραυματισμό .\n" +
                        "Η απώλεια μπορεί να είναι εξωτερική ή εσωτερική. Η εξωτερική αιμορραγία διακρίνεται σε αρτηριακή (έξοδος αίματος με πίδακα όπως οι σφίξεις της καρδιάς), φλεβική (κόκκινο χρώμα), τριχοειδική (πολύ απλή έξοδος αίματος" +
                        ")."), R.drawable.bleeding_types));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αντιμετώπιση Εξωτερικής Αιμορραγίας</b><br>" +
                        "<br>1. Εφαρμόζουμε άμεση πίεση στο σημείο με ένα επίθεμα, μια αποστειρωμένη γάζα, με ένα οποιοδήποτε ύφασμα-πανί." +
                        "<br>2. Εάν ματώσει το πρώτο επίθεμα αφαιρούμε και βάζουμε άλλο στεγνό." +
                        "<br>3. Εάν συνεχίζει να ματώνει το επίθεμα προσθέτουμε και άλλο από επάνω. Δεν αφαιρούμε πλέον κανένα άλλο. Δένουμε τα επιθέματα με έναν επίδεσμο." +
                        "<br>4. Εάν ματώσει ο επίδεσμος δεν τον αφαιρούμε και προσθέτουμε στο σημείο και άλλο επίθεμα και άλλον επίδεσμο."
                ), R.drawable.bleeding_care));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αντιμετώπιση Εξωτερικής Αιμορραγίας</b><br>" +
                        "<br>Εάν συνεχίζει η αιμορραγία πάμε ψηλότερα από το σημείο που αιμορραγεί και εφαρμόζουμε ίσχαιμο περίδεση:" +
                        "<br>1. Με έναν φαρδύ επίδεσμο ή ένα φαρδύ κομμάτι υφάσματος τυλίγουμε σφιχτά ψηλότερα και κεντρικότερα του σημείου που αιμορραγεί και δένουμε με κόμπο." +
                        "<br>2. Τοποθετούμε πάνω στο κόμπο ένα κομμάτι ξύλου, ή ένα\n" +
                        "μαρκαδόρο και σταθεροποιούμε το αντικείμενο με κόμπο."
                ), R.drawable.bleeding_tourniquet));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αντιμετώπιση Εξωτερικής Αιμορραγίας</b><br>" +
                        "<br>3. Γυρίζουμε γύρω- γύρω σαν βίδα σφιχτά μέχρι να σταματήσει\n" +
                        "η αιμορραγία ." +
                        "<br>4. Η σωστή επίδεση πονάει τον τραυματία. Εάν και πάλι δεν σταματήσει και εφόσον έχουμε χώρο εφαρμόζουμε και άλλη ίσχαιμο περίδεση." +
                        "<br><b>Ποτέ δεν αφαιρούμε οτιδήποτε έχουμε εφαρμόσει για έλεγχο της αιμορραγίας.</b>"
                ), R.drawable.bleeding_tourniquet));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αντιμετώπιση Εσωτερικής Αιμορραγίας</b><br>" +
                        "<br>Η αναγνώριση της εσωτερικής αιμορραγίας γίνεται από το είδος του τραυματισμού (τροχαίο, πτώση, πυροβολισμός,μαχαίρωμα)." +
                        "<br>1. Το δέρμα αλλάζει χρώμα γίνεται ωχρό, κρύο, υγρό." +
                        "<br>2. Το θύμα ζαλίζεται, λέει ασυναρτησίες και έχει απώλεια αισθήσεων." +
                        "<br>3. Μπορεί να εξελιχθεί ραγδαία συνήθως εντοπίζεται στην θωρακική κοιλότητα και στην κοιλιακή χώρα." +
                        "<br>4. Άμεση κλήση του ΕΚΑΒ και εάν χρειαστεί έναρξη ΚΑΡΠΑ."
                ), R.drawable.ambulance));
            }else if ("Περιποίηση Τραύματος".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Περιποίηση Τραύματος</b><br>" +
                        "<br>Τα είδη τραυματισμών είναι :" +
                                "<br> -Οι εκδορές της επιδερμίδας." +
                                "<br> -Οι τομές, οι αποσπάσεις." +
                                "<br> -Τα διατριταίνοντα (εισχωρούν σε οποιοδήποτε βάθος)." +
                                "Σκοπός είναι να ελέγξουμε την αιμορραγία και μετά να" +
                                "προλάβουμε την επιμόλυνση."), R.drawable.basic_first_aid));
                steps.add(new InstructionStep(Html.fromHtml("<b>Περιποίηση Τραύματος</b><br>" +
                        "<br>1. Ηρεμούμε τον τραυματία." +
                        "<br>2. Καθαρίζουμε την πληγή με νερό." +
                        "<br>3. Προσεκτικά αφαιρούμε τυγχών ξένα σώματα από το τραύμα." +
                        "<br>4. Εάν δεν μπορούμε να απομακρύνουμε τα ξένα σώματα απευθυνόμαστε στο νοσοκομείο." +
                        "<br>5. Εάν υπάρχει αιμοραγία ασκούμε πίεση με μία γάζα για 10-15'." +
                        "<br>6. Βάζουμε αντισηπτική ουσία και κλείνουμε το τραύμα με αποστειρωμένη γάζα."
                ), R.drawable.wound_care));
                steps.add(new InstructionStep(Html.fromHtml("<b>Περιποίηση Τραύματος</b><br>" +
                        "<br>7. Αλλάζουμε τους επιδέσμους ανά 1-2 ημέρες, μέχρι να επουλωθεί η πληγή." +
                        "<br>8. Αν δούμε ότι στο τραύμα υπάρχει έντονο πρήξιμο, φλόγωση, πόνος και κοκκίνισμα απευθυνόμαστε σε γιατρό, καθώς πιθανόν να έχει μολυνθεί." +
                        "<br>9. Σιγουρευόμαστε ότι ο τραυματίας έχει κάνει αντιτετανικό εμβόλιο. Αν όχι απευθυνόμαστε στο νοσοκομείο."
                ), R.drawable.wound_care2));

            }else if ("Αλλεργία/Αναφυλλακτικό ΣΟΚ".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Αλλεργία/Αναφυλλακτικό ΣΟΚ</b><br>" +
                        "<br>Η αναφυλαξία είναι μια αλλεργική αντίδραση η οποία εξελίσσεται πολύ γρήγορα και μπορεί να είναι απειλητική για τη ζωή. Η εκδήλωση των συμπτωμάτων αφορά τα παρακάτω συστήματα:" +
                        "<br> -Γενικευμένο εξάνθημα, οίδημα στα βλέφαρα/χείλη." +
                        "<br> -Κοιλιακό άλγος, εμετός, διάρροια" +
                        "<br> -Βραχνάδα, δύσπνοια." +
                        "<br> -Πτώση της αρτηριακής πίεσης, αδυναμία,απώλεια αισθήσεων."), R.drawable.basic_first_aid));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αλλεργία/Αναφυλλακτικό ΣΟΚ</b><br>" +
                        "<br>1. Καλούμε άμεσα το ΕΚΑΒ." +
                        "<br>2. Τον ρωτάμε εάν έχει μαζί του ένεση αδρεναλίνης. Εάν έχει,κάνουμε την ένεση στο μπράτσο ή στο μηρό." +
                        "<br>3. Χαλαρώνουμε γραβάτα, ζώνη." +
                        "<br>4. Σε περίπτωση απώλειας αισθήσεων τον φέρουμε σε θέση ασφάλειας. Αν δεν αναπνέει ξεκινάμε ΚΑΡΠΑ." +
                        "<br><b> Όσοι εμφανίζουν αναφυλαξία πρέπει οπωσδήποτε να αναζητήσουν\n" +
                        "ιατρική βοήθεια.<b>"), R.drawable.epi_pen));
            }else if ("Έγκαυμα".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Έγκαυμα</b>" +
                        "<br>Τα είδη του εγκαύματος διαχωρίζονται ανάλογα με το βάθος τους: " +
                        "<br>1. Επιφανειακό-Πρώτου Βαθμού: Πόνος, ερυθρότητα, μικρές φουσκάλες. Αυτόματη επούλωση." +
                        "<br>2. Μερικού Πάχους- Δεύτερου Βαθμού: Πόνος, αυξημένη θερμοκρασία, μεγάλες φυσαλίδες. Ασπρίζουν κατά την πίεση. Αυτόματη επούλωση." +
                        "<br>3. Ολικού Πάχους-Τρίτου Βαθμού: Αναισθησία, ελάχιστες ή καμία φυσαλίδα, δεν ασπρίζουν στην πίεση. Το χρώμα ποικίλει. Για την επούλωση χρειάζεται εκτομή και μόσχευμα."), R.drawable.burn_icon));
                steps.add(new InstructionStep(Html.fromHtml("<b>Έγκαυμα</b><br>" +
                        "<br>Αντιμετώπιση:" +
                        "<br>1. Απομακρύνουμε το θύμα από το αίτιο. Σε περίπτωση τροχαίου, έκρηξης κ.α. θεωρούμε ότι το θύμα έχει και άλλες κακώσεις." +
                        "<br>2. Αφαιρούμε κοσμήματα, ζώνες, υπολείματα κλπ από την εγκαυματική περιοχή." +
                        "<br>3. Για πρώτου και δεύτερου βαθμού εγκαύματα πλένουμε με αύθονο δροσερό νερό για 10-15'." +
                        "<br>4. Απλώνουμνε καταπραϋντικό gel." +
                        "<br>5. Δεν σπάμε τις φουσκάλες." +
                        "<br>6. Εάν το έγκαυμα βρίσκεται στο πρόσωπο ή τα γεννητικά όργανα αναζητούμε ιατρική βοήθεια."), R.drawable.burn_icon));
                steps.add(new InstructionStep(Html.fromHtml("<b>Έγκαυμα</b><br>" +
                        "<br>Για εγκαύματα τρίτου βαθμού:" +
                        "<br>1. Πλένουμε με αύθονο δροσερό νερό για 10-15'." +
                        "<br>2. Αφαιρούμε κοσμήματα, ζώνες, υπολείματα κλπ από την εγκαυματική περιοχή." +
                        "<br>3. Καλύπτουμε με αντισηπτικές γάζες." +
                        "<br>4. Εάν υπάρχει πόνος δίνουμε παυσίπονο." +
                        "<br>5. Αναζητούμε ιατρική βοήθεια."), R.drawable.third_degree_burn));
                steps.add(new InstructionStep(Html.fromHtml("<b>Έγκαυμα</b>" +
                        "<br>Για εγκαύματα που προκαλούνται από τροχαία, πυρκαγία, ηλεκτροπληξία, κεραυνοπληξία τα θύματα θα πρέπει να αντιμετωπίζονται ως πολυτραυματίες:" +
                        "<br>1. Απελευθέρωση αεραγωγού." +
                        "<br>2. Έλεγχος της αναπνοής." +
                        "<br>3. Θανατηφόρες αρρυθμίες."+
                        "<br>4. Πτώση αρτηριακής πίεσης." +
                        "<br>5. Απώλεια αισθήσεων." +
                        "<br>6. Αφαιρούμε τα ρούχα και σκεπάζουμε το θύμα για την αποφυγή υποθερμίας." +
                        "<br>7. Σε εγκαύματα μεγάλης έκτασης δεν ρίχνουμε μεγάλες ποσότητες νερού." +
                        "<br>8. Αναζητούμε ιατρική βοήθεια."), R.drawable.zeus));
            }else if ("Λιποθυμία".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Λιποθυμία</b>" +
                        "<br>Είναι η αιφνίδια, σύντομη, απώλεια των αισθήσεων λόγω παροδικής μείωσης\n" +
                        "της αιμάτωσης του εγκεφάλου . Ο άρρωστος συνέρχεται μόνος του μετά από 1-\n" +
                        "5 λεπτά. " +
                        "<br>Οι αιτίες της λιποθυμίας είναι από πολύ απλές, έως πολύ σοβαρές." +
                        "<br>Η λιποθυμία μοιάζει με κατάσταση ύπνου, καθώς οι ζωτικές λειτουργίες\n" +
                        "διατηρούνται.\n" +
                        "Το άτομο συνήθως είναι ωχρό με κρύο ιδρωμένο δέρμα. Η λιποθυμία μπορεί να\n" +
                        "συνοδεύεται από πολύ σύντομης διάρκειας σπασμούς ή και απώλεια ούρων."), R.drawable.faint_icon));
                steps.add(new InstructionStep(Html.fromHtml("<b>Λιποθυμία</b>" +
                        "<br> -Εάν αισθανθούμε ότι θα λιποθυμήσουμε, ξαπλώνουμε και τοποθετούμε τα\n" +
                        "πόδια μας πιο ψηλά." +
                        "<br> -Εάν βρούμε άτομο σε λιποθυμία, πλησιάζουμε με ασφάλεια,\n" +
                        "ελέγχουμε τον αεραγωγό για να βεβαιωθούμε ότι αναπνέει. Όταν δεν\n" +
                        "ανακτά τις αισθήσεις του, αλλά αναπνέει, το γυρίζουμε σε ασφαλή θέση και\n" +
                        "καλούμε βοήθεια." +
                        "<br> -Όταν δεν έχουμε σημεία κυκλοφορίας αρχίζουμε ΚΑΡΠΑ." +
                        "<br> <b>Σε κάθε περίπτωση λιποθυμικού επεισοδίου πρέπει να ενημερώνεται γιατρός.</b>"), R.drawable.faint_icon));

                }else if ("Έμφραγμα".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Έμφραγμα</b>" +
                        "<br>Είναι η απόφραξη μιας αρτηρίας που πηγαίνει αίμα στην καρδιά, με\n" +
                        "αποτέλεσμα τη νέκρωση της περιοχής. Πολλοί άνθρωποι έχουν συμπτώματα\n" +
                        "ώρες, μέρες ή εβδομάδες πριν το έμφραγμα, όπως όταν έχουν μια σωματική\n" +
                        "δραστηριότητα και εμφανίζεται πόνος ο οποίος εξαφανίζεται όταν\n" +
                        "ξεκουράζονται. Κάποιοι άνθρωποι δεν εμφανίζουν κανένα σύμπτωμα."), R.drawable.heart_attack_picture));
                steps.add(new InstructionStep(Html.fromHtml("<b>Έμφραγμα</b>" +
                        "<br>Συμπτώματα:" +
                        "<br> -Ξαφνική εμφάνιση έντονου πόνου (περιγράφεται σαν να έχει δεχτεί\n" +
                        "μαχαιριά) στο στήθος." +
                        "<br> -Εντοπίζεται σε μεγάλη επιφάνεια του στήθους (χρησιμοποιείται όλη\n" +
                        "η παλάμη όταν θέλει να δείξει που πονάει), διαρκεί περισσότερα από\n" +
                        "5 λεπτά." +
                        "<br> -Ο πόνος εξαπλώνεται στο λαιμό, ώμο, χέρι." +
                        "<br> -Ο πόνος συνοδεύεται από εφίδρωση, ναυτία, εμετό, ζαλάδα,\n" +
                        "λιποθυμία, δύσπνοια."), R.drawable.heart_attack_picture2));
                steps.add(new InstructionStep(Html.fromHtml("<b>Έμφραγμα</b>" +
                        "<br>Όταν παρουσιάζουμε ή βλέπουμε κάποιον με αυτά τα συμπτώματα::" +
                        "<br> -Παραμένουμε στο κρεβάτι ξαπλωμένοι." +
                        "<br> -Καλούμε το 112 ή το 166." +
                        "<br> -Εάν αργεί το 166 θα πρέπει να μας μεταφέρει άλλος στο νοσοκομείο,\n" +
                        "κατά προτίμηση με καρδιολογικό τμήμα και το νοσοκομείο να είναι\n" +
                        "σε εφημερία." +
                        "<br> -Δεν οδηγούμε γιατί μπορεί να επιδεινωθεί η κατάστασή μας, να\n" +
                        "προκαλέσουμε τροχαίο και να χάσουμε τη ζωή μας από τραυματισμό\n" +
                        "ή να τραυματίσουμε κάποιον άλλο."), R.drawable.heart_attack_picture2));

            }else if ("Εγκεφαλικό".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Εγκεφαλικό</b>" +
                        "<br>Ως εγκεφαλικό επεισόδιο ορίζεται η βλάβη του εγκεφάλου που προήλθε είτε από\n" +
                        "διακοπή της παροχής του αίματος στην πάσχουσα περιοχή (ισχαιμικό), είτε\n" +
                        "από αιμορραγία ως επακόλουθο της ρήξης ενός αγγείου (αιμορραγικό). Το\n" +
                        "εγκεφαλικό επεισόδιο είναι μια κατάσταση έκτακτης ανάγκης."), R.drawable.stroke_icon));
                steps.add(new InstructionStep(Html.fromHtml("<b>Εγκεφαλικό</b>" +
                        "<br>Η γρήγορη διάγνωση βοηθάει στη σχεδόν πλήρη αποκατάσταση κυρίως των\n" +
                        "ισχαιμικών επεισοδίων. Εάν δούμε άτομο\n" +
                        "με πτώση μιας πλευράς του προσώπου, μπερδεμένη ομιλία, μειωμένη όραση ή\n" +
                        "βλέπει θολά, αδυναμία να σηκώσει το χέρι, ζάλη, κεφαλαλγία, υποψιαζόμαστε\n" +
                        "και καλούμε βοήθεια. "), R.drawable.stroke_icon));
                steps.add(new InstructionStep(Html.fromHtml("<b>Εγκεφαλικό</b>" +
                        "<br>Υπάρχουν περιπτώσεις όπου η βλάβη είναι μεγάλη" +
                        "και μπορεί να έχουμε απώλεια αισθήσεων μέχρι ανακοπή."+
                        "<br>Οι παράγοντες κινδύνου για εγκεφαλικό επεισόδιο είναι η υψηλή αρτηριακή" +
                        "πίεση, το κάπνισμα, ο διαβήτης, καρδιακή νόσος, ηλικία.  ́Οσο μεγαλώνουμε αυξάνει ο κίνδυνος εγκεφαλικού επεισοδίου."), R.drawable.stroke_icon));
            }else if ("Δηλητηρίαση".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Δηλητηρίαση</b>" +
                        "<br>Δηλητηρίαση είναι, η διαταραχή ζωτικών λειτουργιών από\n" +
                        "ουσίες φυσικές ή χημικές. Μερικές φορές αυτές οι ουσίες μπορεί να είναι\n" +
                        "απειλητικές για τη ζωή. Οι περισσότερες ουσίες εισέρχονται από το στόμα, ενώ ένα μικρότερο ποσοστό είτε εισπνέεται, είτε απορροφάται από το δέρμα\n" +
                        "ή τους βλεννογόνους, ή ενίεται." +
                        "<br><b>Τηλέφωνο Κέντρου Δηλητηριάσεων: 2107793777.</b>"), R.drawable.poisoning_picture));
                steps.add(new InstructionStep(Html.fromHtml("<b>Δηλητηρίαση</b><br>" +
                        "<br>Βασικές Αρχές Αντιμετώπισης:" +
                        "<br>Παροχή απλών οδηγιών:" +
                        "<br> -Τι ηλικία έχει το θύμα;" +
                        "<br> -Ποια είναι η τιξική ουσία;" +
                        "<br> -Ποια ήταν η οδός εισόδου;" +
                        "<br> -Πόσος χρόνος έχει περάσει;" +
                        "<br> -Ποιά είναι η κατάσταση του θύματος;" +
                        "<br> -Πού έγινε;"), R.drawable.poisoning_picture2));
                steps.add(new InstructionStep(Html.fromHtml("<b>Δηλητηρίαση</b>" +
                        "<br>Επί Τόπου Αντιμετώπιση:" +
                        "<br> -Για από στόματος δηλητηρίαση  πρέπει να πραγματοποιηθεί κένωση στομάχου." +
                        "<br> -Για δηλητηρίαση από τους πνεύμονες πρέπει άμεσα να μεταφερθεί το θύμα σε καθαρό αέρα." +
                        "<br> -Για δηλητηρίαση από το δέρμα πρέπει να αφαιρεθούν όλα τα ρούχα και να πλυθεί με άφθονο νερό." +
                        "<br> -Για δηλητηρίαση από τα μάτια με ανοιχτά βλεφαρα πλένουμε με άφθονο νερό." +
                        "<br> -Για δηλητηρίαση με ένεση το θύμα πρέπει να τοποθετηθεί σε θέση ανάνηψης."), R.drawable.poisoning_picture3));
                steps.add(new InstructionStep(Html.fromHtml("<b>Δηλητηρίαση</b><br>" +
                        "<br> -Η μεταφορά πρέπει να γίνει άμεσα στο νοσοκομείο." +
                        "<br> -Ασθενείς χωρίς επικοινωνία πρέπει να βρίσκονται σε θέση ανάνηψης." +
                        "<br> -Όταν δεν έχουμε κυκλοφορία ξεκινάμε ΚΑΡΠΑ." +
                        "<br> <b>Δεν πρέπει να δίνουμε εμφυσήσεις και δεν ακουμπάμε με γυμνά\n" +
                        "χέρια εάν υπάρχει υποψία δηλητηρίασης με τοξικές ουσίες.</b>"), R.drawable.ambulance));
            }else if ("Επιληπτική Κρίση".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Επιληπτική Κρίση<br></b>" +
                        "<br>Επιληψία είναι διαταραχή του εγκεφάλου, εκδηλώνεται με διάφορες\n" +
                        "παθολογικές καταστάσεις από τον οργανισμό οι οποίες περιλαμβάνουν από\n" +
                        "μια απλή αφαίρεση χωρίς απώλεια αισθήσεων μέχρι σπασμούς και απώλεια\n" +
                        "αισθήσεων."), R.drawable.epilepsy_icon));
                steps.add(new InstructionStep(Html.fromHtml("<b>Επιληπτική Κρίση</b><br>" +
                        "<br>Αντιμετώπιση:" +
                        "<br> -Όσοι παρουσιάζουν απώλεια αισθήσεων τοποθετούνται σε θέση\n" +
                        "ασφαλείας." +
                        "<br> -Τοποθετούμε το θύμα μαλακά στο δάπεδο." +
                        "<br> -Το προστατεύουμε από πιθανούς τραυματισμούς." +
                        "<br> -Βάζουμε κάτω από το κεφάλι του κάποιο μαλακό αντικείμενο για\n" +
                        "αποφυγή τραυματισμού του."), R.drawable.epilepsy_icon));
                steps.add(new InstructionStep(Html.fromHtml("<b>Επιληπτική Κρίση</b><br>" +
                        "<br>Τι δεν κάνουμε:" +
                        "<br> -Δεν περιορίζουμε το θύμα και δεν το ακινητοποιούμε." +
                        "<br> -Δεν προσπαθούμε να το επαναφέρουμε με χαστούκια.." +
                        "<br> -Δεν βάζουμε τίποτα στο στόμα του, ούτε προσπαθούμε να το\n" +
                        "ανοίξουμε." +
                        "<br> -Δεν του δίνουμε τίποτα να πιει από το στόμα." +
                        "<br> -Μετά το τέλος των σπασμών και εάν δεν έχει ανακτήσει τις αισθήσεις του,\n" +
                        "το τοποθετούμε σε θέση ασφαλείας."), R.drawable.epilepsy_icon));
                steps.add(new InstructionStep(Html.fromHtml("<b>Επιληπτική Κρίση</b><br>" +
                        "<br>Καλούμε 112 ή 166 στις περιπτώσεις όπου:" +
                        "<br> -Οι σπασμοί συνεχίζουν περισσότερα από 5 λεπτά." +
                        "<br> -Το θύμα δεν ανακτά τις αισθήσεις του μετά από 10 λεπτά." +
                        "<br> -Εάν ακολουθήσει γρήγορα και άλλη επιληπτική κρίση." +
                        "<br> -Έχει τραυματιστεί." +
                        "<br> -Είναι έγκυος." +
                        "<br> -Είναι διαβητικός." +
                        "<br> -Έχει πάθει κρίση μέσα στο νερό."), R.drawable.ambulance));

            }

            InstructionsSlideAdapter adapter = new InstructionsSlideAdapter(steps);
            viewPager.setAdapter(adapter);
        }

        return root;
    }
}
