package com.example.project1.ui.instructions;

import com.example.project1.ui.instructions.InstructionsSlideAdapter;
import android.text.Html;
import android.os.Bundle;
import android.util.Log;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;
import androidx.viewpager2.widget.ViewPager2;

import com.example.project1.R;

import java.util.ArrayList;
import java.util.List;

public class InstructionsFragment extends Fragment {

    public InstructionsFragment() {
        // Required empty public constructor
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        View root = inflater.inflate(R.layout.fragment_instructions, container, false);

        Bundle args = getArguments();
        if (args != null) {
            String title = args.getString("title");

            Log.d("InstructionsFragment", "title: " + title);

            TextView titleTextView = root.findViewById(R.id.instructions_title);
            titleTextView.setText(title);


            ViewPager2 viewPager = root.findViewById(R.id.instructions_pager);
            List<InstructionStep> steps = new ArrayList<>();

            //slides
            //Βασικές Γνώσεις
            if ("Βασικές Γνώσεις".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Βασικές Οδηγίες και Γνώσεις.</b> <br><br>" +
                        " Προσέγγιση Θύματος, θέση ασφαλείας και αξιολόγηση της κατάστασης"), R.drawable.general_basic
                ));
                steps.add(new InstructionStep(Html.fromHtml("<b>Ασφαλής Προσέγγιση Ασθενούς</b><br><br>1. Φροντίστε να είστε ασφαλείς και να προστατεύετε τον τραυματισμένο από περαιτέρω κινδύνους.<br>" +
                        "2. Αν ο τραυματισμός είναι σοβαρός, καλέστε το ΕΚΑΒ (166) ή το 112.<br>" +
                        "3. Αποφύγετε την επαφή με τα σωματικά υγρά του θύματος. Χρησιμοποιείστε γάντια.<br>"), R.drawable.second_slide_basic));
                steps.add(new InstructionStep(Html.fromHtml("<b>Εκτίμηση Πάσχοντα</b><br><br>Η εκτίμηση του πάσχοντα γίνεται σύμφωνα με μια σειρά ενεργειών, οι οποίες είναι ίδιες σε όλο τον κόσμο:" +
                        "<br>1. Έλεγχος του αεραγωγού." +
                        "<br>2. Έλεγχος για την ύπαρξη αναπνοής." +
                        "<br>3. Έλεγχος της κυκλοφορίας." +
                        "<br>4. Νευρολογικός Έλεγχος" +
                        "<br>5. Έκθεση και προστασία από το περιβάλλον"), R.drawable.second_slide_basic));
                steps.add(new InstructionStep(Html.fromHtml("<b>Κλήση στο ΕΚΑΒ</b><br><br>Τι πρέπει να συμπεριλάβουμε στην κλήση στο ΕΚΑΒ:" +
                        "<br>1. Το τηλέφωνο και το όνομά μας." +
                        "<br>2. Τι περιστατικό έχει συμβεί." +
                        "<br>3. Πού έγινε το περιστατικό." +
                        "<br>4. Πόσα είναι τα θύματα." +
                        "<br>5. Πότε έγινε." +
                        "<br>6. Άλλες σημαντικές πληροφορίες." +
                        "<br><b>Κλέινουμε πάντα τελευταίοι το τηλέφωνο!</b>"), R.drawable.fourth_slide_basic));
                steps.add(new InstructionStep(Html.fromHtml("<b>Θέση Ασφαλείας (1/2)</b><br>Εάν το θύμα έχει χάσει τις αισθήσεις του, αλλά αναπνέει, το τοποθετούμε σε θέση ασφαλείας.<br>" +
                        "<br>1. Τοποθετούμε το άτομο ανάσκελα με τα πόδια του σε ευθεία και τα χέρια κοντά στο σώμα." +
                        "<br>2. Τοποθετούμε το ένα χέρι σε ορθή γωνία προς τα πάνω." +
                        "<br>3. Φέρνουμε το άλλο χέρι πάνω στο στήθος με κατεύθυνση προς τον ώμο, και την παλάμη προς τα κάτω."), R.drawable.recovery_position));
                steps.add(new InstructionStep(Html.fromHtml("<b>Θέση Ασφαλείας (2/2)</b><br>Εάν το θύμα έχει χάσει τις αισθήσεις του, αλλά αναπνέει, το τοποθετούμε σε θέση ασφαλείας.<br>" +
                        "<br>4. Από την ίδια πλευρά. λυγίζουμε το πόδι ώστε να πατήσει στο έδαφος το πέλμα." +
                        "<br>5. Γυρίζουμε το θύμα στο πλάι, ώστε το λυγισμένο πόδι να είναι από πάνω." +
                        "<br>6. Φέρνουμε το κεφάλι σε ελαφρά έκταση, για να μην παρεμποδίζεται ο αεραγωγός." +
                        "<br><b>Καλoύμε το ΕΚΑΒ ή το 112!</b>"), R.drawable.recovery_position));
            //οδηγίες ΚΑΡΠΑ
            } else if ("ΚΑΡΠΑ".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Καρδιοαναπευστική Αναζωογόνηση (ΚΑΡΠΑ)</b><br><br>" +
                        "Εάν το θύμα δεν ανταποκρίνεται, τότε εφαρμόζουμε το πρωτόκολλο βασικής υποστήριξης ζωής."), R.drawable.first_slide_basic));
                steps.add(new InstructionStep(Html.fromHtml("<b>Καρδιοαναπευστική Αναζωογόνηση (ΚΑΡΠΑ)</b><br>" +
                        "<br>1. Ελέγχουμε εάν ο αεραγωγός είναι ανοιχτός." +
                        "<br>2. Ελέγχουμε εάν ο αεραγωγός είναι ανοιχτός." +
                        "<br>3. Κρατώντας από το μέτωπο και το σαγόνι, εκτείνουμε το κεφάλι προς τα πίσω για να απελλεύθερωθεί ο αεραγωγός από την γλώσσα."), R.drawable.second_slide_cpr));
                steps.add(new InstructionStep(Html.fromHtml("<b>ΚΑΡΠΑ</b><br>" +
                        "<br>Για 10 δευτερόλεπτα:" +
                        "<br>1. <b>Βλέπω</b> αν ανεβοκατεβαίνει ο θώρακας." +
                        "<br>2. <b>Ακούω</b> αν βγαίνει αέρας από την μύτη και το στόμα." +
                        "<br>3. <b>Αισθάνομαι</b> στο μάγουλό μου την κίνηση και την υγρασία του αέρα." +
                        "<br>Ψάχνω για κανονικές αναπνοές, χωρίς παράξενους ήχους. Εάν δεν δούμε, ακούσουμε, αισθανθούμε, άμεσα καλούμε το ΕΚΑΒ και ξεκινάμε θωρακικές συμπιέσεις."), R.drawable.second_slide_cpr));
                steps.add(new InstructionStep(Html.fromHtml("<b>Θωρακικές Συμπιέσεις</b><br>" +
                        "<br>Οι Θωρακικές συμπιέσεις γίνονται στην μέση του θώρακα, πάνω στο στέρνο:" +
                        "<br>1. Βάζουμε το ένα χέρι πάνω στο άλλο και πλέκουμε τα δάκτυλά μας." +
                        "<br>2. Βάζουμε την βάση της παλάμης μας στο κάτω μισό του στέρνου." +
                        "<br>3. Τεντώνουμε τους αγκώνες και με ώμους παράλληλους στο θύμα ξεκινάμε συμπιέσεις." +
                        "<br>4. Κάνουμε 30 θωρακικές συμπιέσεις, με το βάρος του σώματός μας, ρυθμό 100-120 ανά λεπτό και βάθος 5-6 cm."), R.drawable.chest_compressions_cpr));
                steps.add(new InstructionStep(Html.fromHtml("<b>Εμφυσήσεις</b><br>" +
                        "<br>1. Απελευθερώνουμε τον αεραγωγό." +
                        "<br>2. Εκτείνουμε το κεφάλι, ανυψώνουμε το πιγούνι και κλείνουμε την μύτη." +
                        "<br>3. Σφραγίζουμε τα χείλη μας γύρω από το στόμα του θύματος και εκπνέουμε μέχρι να ανυψωθεί ο θώρακας." +
                        "<br>4. Απομακρύνουμε το κεφάλι μας για να κάνει εκπνοή και επαναλλαμβάνουμε για δεύτερη φορά." +
                        "<br><b>Εφαρμόζουμε την διαδικασία των 30 συμπιέσεων και 2 εμφυσήσεων μέχρι να έρθει βοήθεια ή το θύμα να ανανήψει.</b>"), R.drawable.rescue_breaths_cpr));
            //οδηγιες απινιδωτη
            }else if("Χρήση Αυτόματου Απινιδωτή".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Αυτόματος Εξωτερικός Απινιδωτής</b><br>" +
                        "<br>Ο Αυτόματος Εξωτερικός Απινιδωτής συναντάται σε πολυσύχναστους χώρους. Υπάρχει ευκρινής και συγκεκριμένη σηματοδότηση του χώρου στο οποίο είναι εγκαταστημένοι."), R.drawable.sign_aed));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αυτόματος Εξωτερικός Απινιδωτής</b><br>" +
                        "<br>1. Είναι ασφαλές μηχάνημα." +
                        "<br>2. Ακολουθούμε τις οδηγίες που μας λέει." +
                        "<br>3. Πρέπει να βρισκόμαστε σε χώρο που δεν έχει νερά και μεταλλικές επιφάνειες." +
                        "<br>4. Ακολουθούμε το πρωτόκολλο όπως και όταν δεν έχουμε απινιδωτή." +
                        "<br>5. Ζητάμε σε κάποιον να φέρει τον απινιδωτή όσο συνεχίζουμε να κάνουμε ΚΑΡΠΑ."), R.drawable.aed_picture));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αυτόματος Εξωτερικός Απινιδωτής</b><br>" +
                        "<br>6. Ακολουθούμε τις οδηγίες που μας δίνει ο απινιδωτής." +
                        "<br>7. Στο γυμνό και στεγνό στέρνο τοποθετούμε τα αυτοκόλλητα ηλεκτρόδια ως εξής:" +
                        "<br>   - Το ένα μια παλάμη κάτω από την αριστερή μασχάλη." +
                        "<br>   - Το δεύτερο λίγο κάτω από την δεξιά κλείδα." +
                        "<br>8. Βάζουμε στην υποδοχή της συσκευής το βύσμα των ηλεκτροδίων και αυτή αναλύει τον καρδιακό παλμό." +
                        "<br>9. Απομακρύνουμε τον κόσμο και δεν ακουμπάμε ούτε εμείς το θύμα."), R.drawable.aed_placement));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αυτόματος Εξωτερικός Απινιδωτής</b><br>" +
                        "<br>10. Αν η συσκευή κρίνει απαραίτητη την απινίδωση, αρχίζει να φορτίζει και ακούγεται ένας χαρακτηριστικός ήχος όταν είναι έτοιμη." +
                        "<br>11. Φωνάζουμε<br> <b>ΑΠΟΜΑΚΡΥΝΘΕΙΤΕ ΘΑ ΔΩΣΩ ΡΕΥΜΑ</b>." +
                        "<br>12. Όταν βεβαιωθούμε ότι κανείς, όυτε εμείς, ακουμπάει το θύμα πατάμε το κουμπί και δίνουμε την ηλεκτρική εκκένωση."
                        ), R.drawable.aed_picture1));
                steps.add(new InstructionStep(Html.fromHtml("<b>Αυτόματος Εξωτερικός Απινιδωτής</b><br>" +
                        "<br>13. Μετά ακολουθούμε τις οδηγίες του απινιδωτή." +
                        "<br>14. Αν το θύμα αρχίσει να αναπνέει κανονικά, το τοποθετούμε σε πλάγια θέση ασφαλείας." +
                        "<br>15. Αν δεν επανέλθει συνεχίζουμε την ΚΑΡΠΑ."), R.drawable.recovery_position));
            //κουτι πρώτων βοηθειών
            } else if ("Κουτί Πρώτων Βοηθειών".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Κουτί πρώτων Βοηθειών</b><br>" +
                        "<br>Ένα καλά εξοπλισμένο κουτί πρώτων βοηθειών μπορεί να βοηθήσει\n" +
                        "αποτελεσματικά στους απλούς τραυματισμούς ή σε καταστάσεις έκτακτης\n" +
                        "ανάγκης. Έχουμε ένα κουτί πρώτων βοηθειών στο σπίτι μας και ένα στο\n" +
                        "αυτοκίνητό μας. Αποθηκεύουμε σε προσβάσιμο μέρος μακριά από παιδιά." +
                        "ριά από παιδιά."), R.drawable.first_aid_kit_picture));
                steps.add(new InstructionStep(Html.fromHtml("<b>Κουτί πρώτων Βοηθειών</b><br>" +
                        "<br><b>Βασικός Εξοπλισμός:</b>" +
                        "<br>1. Γάντια" +
                        "<br>2. Ψαλίδι" +
                        "<br>3. Ελαστικοί Επίδεσμοι" +
                        "<br>4. Γάζες απλές και αποστειρωμένες" +
                        "<br>5. Αντισηπτικό Υγρό" +
                        "<br>6. Θερμόμετρο" +
                        "<br>7. Σακούλες σε διάφορα μεγέθη"), R.drawable.first_aid_supplies));
                steps.add(new InstructionStep(Html.fromHtml("<b>Κουτί πρώτων Βοηθειών</b><br>" +
                        "<br><b>Φάρμακα:</b>" +
                        "<br>1. Αντιπυρρετικά" +
                        "<br>2. Παυσίπονα" +
                        "<br>3. Αντισταμινικά Χάπια" +
                        "<br>4. Αντιβιωτική Αλοιφή" +
                        "<br>5. Χάπια για την διάρροια" +
                        "<br>6. Gel για εγκαύματα" +
                        "<br>7. EpiPen/Αδρεναλίνη για αλλεργίες αν έχει συνταγογραφηθεί από γιατρό"), R.drawable.first_aid_medicine));
            //πνιγμονή
            }else if ("Πνιγμονή από Ξένο Σώμα".equals(title)) {
                steps.add(new InstructionStep(Html.fromHtml("<b>Πνιγμονή από Ξένο Σώμα</b><br><br>" +
                        "Η απόφραξη μπορεί να είναι μερική ή πλήρης. Αφορά ενήλικες μετά από λήψη τροφής."+
                        "<br> -Στη μερική απόφραξη το θύμα έχει έντονη ανησυχία και βήχα." +
                        "<br> -Στη πλήρη απόφραξη το θύμα δεν μπορεί να μιλήσει, να βήξει ή να αναπνεύσει." +
                        "<br> -Χάνει γρήγορα τις αισθήσεις του." +
                        "<br> -Το θύμα πνιγμονής συνήθως φέρνει τα χέρια του στο λαιμό."), R.drawable.heimlich_picture));
                steps.add(new InstructionStep(Html.fromHtml("<b>Πνιγμονή από Ξένο Σώμα</b><br>" +
                        "<br>1. Εάν το θύμα αναπνέει ενθαρρύνουμε να βήξει δυνατά κοιτάζοντας προς τα κάτω." +
                        "<br>2. Το βοηθάμε να σκύψει μπροστά και το χτυπάμε με τη βάση της παλάμης ανάμεσα στις δύο ωμοπλάτες με πέντε δυνατά χτυπήματα." +
                        "<br>3. Εάν εξακολουθήσει να υπάρχει απόφραξη τότε εφαρμόζουμε 5 κοιλιακές ώσεις αμέσως κάτω από την ξιφοειδή απόφυση. Βάζοντας το ένα χέρι μας σε μπουνιά και πιέζοντας με το άλλο μέσα και πάνω." +
                        "Στις έγκυες γυναίκες γίνεται στο κέντρο του θώρακα."), R.drawable.heimlich_adult));
                steps.add(new InstructionStep(Html.fromHtml("<b>Πνιγμονή από Ξένο Σώμα<br><br>" +
                        "Πώς να βοηθήσουμε τον εαυτό μας:</b>"+
                        "<br>1. Σίγουρα θα αρχίζουμε να βήχουμε για να αποβληθεί το ξένο σώμα." +
                        "<br>2. Εάν εξακολουθήσει η απόφραξη τότε πηγαίνουμε σε μια κόχη όπως ένα τραπέζι ή πλάτη μιας καρέκλας και πιέζουμε εκεί που τελειώνει το στέρνο, στην ξιφοειδή απόφυση."), R.drawable.heimlich_alone));
                steps.add(new InstructionStep(Html.fromHtml("<b>Πνιγμονή από Ξένο Σώμα</b><br><br>" +
                        "Μανούβρα Heimlich σε παιδιά:"+
                        "<br>1. Εάν το παιδί αναπνέει το ενθαρρύνουμε να βήξει δυνατά." +
                        "<br>2. Βοηθάμε το παιδί να σκύψει μπροστά και το κτυπάμε με τη βάση της παλάμης ανάμεσα στις δύο ωμοπλάτες με πέντε δυνατά χτυπήματα." +
                        "<br>1. Εάν εξακολουθεί να υπάρχει απόφραξη τότε εφαρμόζουμε 5 κοιλιακές ωθήσεις στην ξιφοειδή απόφυση. Οι συμπιέσεις στην κοιλιά επιτρέπονται από το 2ο έτος της ηλικίας."
                ), R.drawable.heimlich_child));
                steps.add(new InstructionStep(Html.fromHtml("<b>Πνιγμονή από Ξένο Σώμα</b><br><br>" +
                        "Μανούβρα Heimlich σε βρέφη:"+
                        "<br>1. Εάν το βρέφος δεν αναπνέει και δεν κλαίει, το βάζουμε στον πήχη του ενός χεριού μας και κρατώντας το σαγόνι του ανοιχτό χτυπάμε 5 φορές ανάμεσα στις ωμοπλάτες." +
                        "<br>2. Εάν εξακολουθεί να υπάρχει απόφραξη εφαρμόζουμε 5 θωρακικές συμπιέσεις ανάμεσα από τις θηλές." +
                        "<br><b>Σε κάθε περίπτωση αν το θύμα χάσει τις αισθήσεις του και καταρρεύσει εφαρμόζουμε την ΚΑΡΠΑ!</b>"
                ), R.drawable.heimlich_infant));

            }

            InstructionsSlideAdapter adapter = new InstructionsSlideAdapter(steps);
            viewPager.setAdapter(adapter);
        }

        return root;
    }
}
